"""
Этот модуль содержит команды для плавного перемещения спрайтов.

Команды этого модуля очень похожи на команды из модуля sprite.
Отличие между ними в том, что команды из этого модуля выполняются медленно. А команды из модуля sprite - мгновенно.

Например, команда move_to_pos модуля sprite перемещает спрайт на новое место мгновенно. А в этом модуле команда будет перемещать его постепенно, так что будет похоже, что спрайт идет.
"""

# from wrap_py import sprite_actions


def move_to_pos(id: int, x: int, y: int, delay: int = 1000) -> object:
    """
    Перемещает спрайт на новое место на экране. Спрайт будет перемещаться в течение delay миллисекунд.

    :param id: Уникальный номер спрайта, который нужно переместить.
    :param x:
    :param y: на какие координаты переместить спрайт
    :param delay: за сколько миллисекунд переместить спрайт
    :return: None
    """
    return sprite_actions.move_sprite_to(id, delay, x, y)

def w1():
    global sprite_actions
    from wrap_py import sprite_actions


w1()